CF/Catalogs/ПравилаИменованияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ПравилаИменованияНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПравила</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыСвойств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Набор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАлкогольнойПродукцииЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПлатежногоАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыПлатежныхАгентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БазовыеЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортнаяАлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСерийныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодовДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Марки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборУпаковок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемДАЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительИмпортерАлкогольнойПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводДробногоКоличества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСерийногоНомера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСерийныхНомеровСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСрокаДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокДействияПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродукцияМаркируемаяДляГИСМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМВид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКиЗГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМСпособВыпускаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыпускаВОборотГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМРазмер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазмерыКиЗГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМехаГИСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМехаГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидАлкогольнойПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабачнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбувнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Catalogs/НаборыДополнительныхРеквизитовИСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НаборыДополнительныхРеквизитовИСведений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Catalogs/ПравилаИменованияНоменклатуры/Forms/КонструкторПравилаИменования/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Правило"	  ,		Правило);
	Параметры.Свойство("НаборыСвойств",		НаборыСвойств);
	Параметры.Свойство("Номенклатура" ,		Номенклатура);
	Параметры.Свойство("ВидНоменклатуры",	ВидНоменклатуры);
	Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		НаборыСвойств.Очистить();
		НаборыСвойств.Добавить(ВидНоменклатуры.НаборСвойств);
	КонецЕсли;
		
	Если НаборыСвойств.Количество() = 0 Тогда  
		РаботаСПравиламиИменованияВызовСервера.ЗаполнитьНаборыСвойств(НаборыСвойств);		
	КонецЕсли;
	
	УстановитьПараметрыВыбораНоменклатуры();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ОбновитьДеревоРеквизитовИСведений();
	
	Если ЗначениеЗаполнено(Правило) и ЗначениеЗаполнено(Номенклатура) Тогда
		ПриИзмененииНоменклатурыКлиент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ПриИзмененииНоменклатурыКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизитыИСведения

&НаКлиенте
Процедура РеквизитыИСведенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ПутьКДанным = Элемент.ТекущиеДанные.ПутьКДанным;
	
	Если ЗначениеЗаполнено(ПутьКДанным) Тогда
		
		ВставитьПараметрВПравило(ПолучитьТекстДляВставкиПараметра(ПутьКДанным));
		
		ОбновитьНаборыСвойств(ПутьКДанным);
		
		ОбновитьДеревоРеквизитовИСведений();

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыИСведенияНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ПутьКДанным = Элемент.ТекущиеДанные.ПутьКДанным;
	Если ЗначениеЗаполнено(ПутьКДанным) Тогда
		ПараметрыПеретаскивания.Значение = ПолучитьТекстДляВставкиПараметра(ПутьКДанным);
	Иначе
		Выполнение = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РеквизитыИСведенияОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
		
	ОбновитьНаборыСвойств(Элемент.ТекущиеДанные.ПутьКДанным);
	
	ОбновитьДеревоРеквизитовИСведений();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте                                                                                           
Процедура Проверить(Команда)
	
	ПроверитьЗаполнениеПравила();
		
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ПроверитьЗаполнениеПравила(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьУказатьПутьКДаннымНажатие(Элемент)
	
	ЗаполнитьИменаДополнительныхРеквизитовИСведений();	
	ОбновитьДеревоРеквизитовИСведений();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеПравила(ЗакрыватьФорму = Ложь)
	
	ОчиститьСообщения();
	СтруктураПравила = ПолучитьСтруктуруПравила();
	Если СтруктураПравила.ЕстьОшибки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обнаружены ошибки:'"));
		Для Каждого Ошибка Из СтруктураПравила.ОписаниеОшибок Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка);
		КонецЦикла;
	Иначе
		Если ЗакрыватьФорму Тогда
			СтруктураПравила.Вставить("Номенклатура",Номенклатура);
			Закрыть(СтруктураПравила);
		Иначе
			ЗагрузитьДоступныеПараметры(СтруктураПравила);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДоступныеПараметры(СтруктураПравила)
	
	ТаблицаДоступныхПараметров.Загрузить(СтруктураПравила.ТаблицаДоступныхПараметров.Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНоменклатурыКлиент()
	
	СтруктураПравила = ПолучитьСтруктуруПравила();
	
	Если СтруктураПравила.ЕстьОшибки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обнаружены ошибки:'"));
		Для Каждого Ошибка Из СтруктураПравила.ОписаниеОшибок Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка);
		КонецЦикла;
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьТаблицуНоменклатураДополнительныеРеквизитыИСведения(СтруктураПравила.ПараметрыПравила);

	СформироватьНаименование(СтруктураПравила);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаборыСвойств(ПутьКДанным)
	
	Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСПравиламиИменованияКлиент.ОбновитьНаборыСвойств(ПутьКДанным,НаборыСвойств,ТаблицаДоступныхПараметров);
		
КонецПроцедуры

&НаКлиенте
Процедура ВставитьПараметрВПравило(ТекстДляВставки)
	
	СтрокаНач = 0;
	СтрокаКон = 0;
	КолонкаНач = 0;
	КолонкаКон = 0;
	
	Элементы.Правило.ПолучитьГраницыВыделения(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
	
	Если (КолонкаКон = КолонкаНач) И (КолонкаКон + СтрДлина(ТекстДляВставки)) > Элементы.Правило.Ширина / 8 Тогда
		Элементы.Правило.ВыделенныйТекст = "";
	КонецЕсли;
		
	Элементы.Правило.ВыделенныйТекст = ТекстДляВставки;
			
	ТекущийЭлемент = Элементы.Правило;
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилоПриИзменении(Элемент)
		
	СтруктураПравила = ПолучитьСтруктуруПравила();
	
	Если СтруктураПравила.ЕстьОшибки Тогда
		Для Каждого Ошибка Из СтруктураПравила.ОписаниеОшибок Цикл
			Если Ошибка <> НСтр("ru = 'В правило необходимо добавить хотя бы один параметр;'") Тогда
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СформироватьНаименование(СтруктураПравила);

	Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	НаборыСвойствТекущие = СтруктураПравила.НаборыСвойств;
	
	Если НаборыСвойств.Количество() = НаборыСвойствТекущие.Количество() Тогда	
		ОбновитьДерево = Ложь;
		Для Сч = 0 По НаборыСвойств.Количество() - 1 Цикл
			Если НаборыСвойств[Сч ].Значение <> НаборыСвойствТекущие[Сч].Значение Тогда
				ОбновитьДерево = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе			
		ОбновитьДерево = Истина;
	КонецЕсли;	
	
	Если ОбновитьДерево Тогда
		НаборыСвойств.ЗагрузитьЗначения(НаборыСвойствТекущие.ВыгрузитьЗначения());
		ОбновитьДеревоРеквизитовИСведений();
		УстановитьПараметрыВыбораНоменклатуры();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруПравила()
	
	Возврат РаботаСПравиламиИменованияКлиент.ПолучитьСтруктуруПравилаИменования(Правило,НаборыСвойств,ТаблицаДоступныхПараметров);
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекстДляВставкиПараметра(ПутьКДанным)
	
	Возврат РаботаСПравиламиИменованияКлиент.ПолучитьТекстДляВставкиПараметра(ПутьКДанным); 
	
КонецФункции

&НаСервере
Процедура ОбновитьДеревоРеквизитовИСведенийСервер()
	
	ДеревоРеквизитовИСведений = РаботаСПравиламиИменования.ПолучитьДеревоРеквизитовИСведений(НаборыСвойств,ТаблицаДоступныхПараметров);
	ЗначениеВРеквизитФормы(ДеревоРеквизитовИСведений,"РеквизитыИСведения");
	
	СвойстваКОбработке.Очистить();
	ТаблицаСвойствКОбработке = ТаблицаДоступныхПараметров.Выгрузить(,"Свойство");
	ТаблицаСвойствКОбработке.Свернуть("Свойство");
	Для Каждого Строка из ТаблицаСвойствКОбработке Цикл
		Если Строка.Свойство.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		СвойстваКОбработке.Добавить(Строка.Свойство);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьДеревоРеквизитовИСведений()
	
	МассивРазвернутыхЭлементов = Новый Массив;
	
	ЗаполнитьРазвернутыеЭлементыДерева(МассивРазвернутыхЭлементов);
	
	ОбновитьДеревоРеквизитовИСведенийСервер();
		
	Если СвойстваКОбработке.Количество() > 0 Тогда
		Элементы.НадписьУказатьПутьКДанным.Заголовок = "Указать путь к данным (" + СвойстваКОбработке.Количество() + ")";
		Элементы.НадписьУказатьПутьКДанным.Видимость = Истина;
	Иначе
		Элементы.НадписьУказатьПутьКДанным.Видимость = Ложь;
	КонецЕсли;
	
	РазвернутьЭлементыДерева(МассивРазвернутыхЭлементов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРазвернутыеЭлементыДерева(МассивРазвернутыхЭлементов)
	
	Для каждого ЭлементКоллекции Из РеквизитыИСведения.ПолучитьЭлементы() Цикл
		
		ИдентификаторЭлемента = ЭлементКоллекции.ПолучитьИдентификатор(); 
			
		Если Элементы.РеквизитыИСведения.Развернут(ИдентификаторЭлемента) Тогда
			МассивРазвернутыхЭлементов.Добавить(ЭлементКоллекции.ИмяПараметра);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьЭлементыДерева(МассивРазвернуть)
	
	Для каждого ЭлементКоллекции Из РеквизитыИСведения.ПолучитьЭлементы() Цикл
		
		ИдентификаторЭлемента = ЭлементКоллекции.ПолучитьИдентификатор(); 
		
		Если МассивРазвернуть.Найти(ЭлементКоллекции.ИмяПараметра) <> Неопределено Тогда
			Элементы.РеквизитыИСведения.Развернуть(ИдентификаторЭлемента);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНоменклатураДополнительныеРеквизитыИСведения(ПараметрыПравила)
		
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		НоменклатураДополнительныеРеквизитыИСведения.Очистить();
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство.Имя КАК ПутьКДанным,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК ДанныеПараметра
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура";
				   
				   
	НоменклатураДополнительныеРеквизитыИСведения.Загрузить(Запрос.Выполнить().Выгрузить());			   
				   
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Номенклатура);
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл
		СтрокаДопСведение = НоменклатураДополнительныеРеквизитыИСведения.Добавить();
		СтрокаДопСведение.ПутьКДанным = Запись.Свойство.Имя;
		СтрокаДопСведение.ДанныеПараметра = Запись.Значение;
	КонецЦикла;
		
	МассивИмен = Новый Массив;
	Для Каждого ПараметрПравила из ПараметрыПравила Цикл	
		МассивСтрок = НоменклатураДополнительныеРеквизитыИСведения.НайтиСтроки(Новый Структура("ПутьКДанным",ПараметрПравила.ПутьКДанным));
		Если МассивСтрок.Количество() = 0 Тогда
			МассивИмен.Добавить(ПараметрПравила.ПутьКДанным);	
		КонецЕсли;
	КонецЦикла;
	
	Если МассивИмен.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеРеквизитыИСведения.Имя КАК Имя,
	               |	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначения
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	НЕ ДополнительныеРеквизитыИСведения.ПометкаУдаления
	               |	И ДополнительныеРеквизитыИСведения.НаборСвойств В ИЕРАРХИИ(ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура))
	               |	И ДополнительныеРеквизитыИСведения.Имя В(&МассивИмен)";
	Запрос.УстановитьПараметр("МассивИмен",МассивИмен);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДопСвойство = НоменклатураДополнительныеРеквизитыИСведения.Добавить();
		СтрокаДопСвойство.ПутьКДанным = Выборка.Имя;
		СтрокаДопСвойство.ДанныеПараметра = Выборка.ТипЗначения.ПривестиЗначение();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименование(СтруктураПравила)

	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		ПримерНаименования = "";
		Возврат;
	КонецЕсли;	
		
	Для Каждого Параметр из СтруктураПравила.ПараметрыПравила Цикл
		
		ДанныеПараметра = "";
		
		Если СтрНайти(Параметр.ПутьКДанным,"Номенклатура.") > 0 Тогда
			ИмяРеквизита = Прав(Параметр.ПутьКДанным,СтрДлина(Параметр.ПутьКДанным) - 13);
			ДанныеПараметра = Формат(Номенклатура[ИмяРеквизита],"ДЛФ=Д; БЛ='Ложь'; БИ='" + Параметр.ИмяПараметра + "'");
		Иначе
			СтрокиДопРеквизитыИСведения = НоменклатураДополнительныеРеквизитыИСведения.НайтиСтроки(Новый Структура("ПутьКДанным",Параметр.ПутьКДанным));
			Если СтрокиДопРеквизитыИСведения.Количество() > 0 Тогда
				ДанныеПараметра = Формат(СтрокиДопРеквизитыИСведения[0].ДанныеПараметра,"ДЛФ=Д; БЛ='Ложь'; БИ='" + Параметр.ИмяПараметра + "'");
			КонецЕсли;			
		КонецЕсли;
		Параметр.Вставить("ДанныеПараметра",ДанныеПараметра);		
	КонецЦикла;
	
	ПримерНаименования = РаботаСПравиламиИменованияКлиентСервер.ПреобразоватьСтрокуПоПравилу(Правило,СтруктураПравила.ПараметрыПравила,"ПутьКДанным","ДанныеПараметра");
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИменаДополнительныхРеквизитовИСведений()
	
	РаботаСПравиламиИменования.ЗаполнитьИменаДополнительныхРеквизитовИСведений();

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораНоменклатуры()
	
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления",Ложь));

	Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", ВидНоменклатуры));	
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
		
		Запрос = Новый Запрос;	
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры
		               |ИЗ
		               |	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		               |ГДЕ
		               |	ВидыНоменклатуры.НаборСвойств В(&НаборСвойств)";
						
		Запрос.УстановитьПараметр("НаборСвойств",НаборыСвойств);
		
		Выборка = Запрос.Выполнить().Выбрать();
		МассивДоступныхВидовНоменклатуры = Новый Массив;
		Пока Выборка.Следующий() Цикл
			МассивДоступныхВидовНоменклатуры.Добавить(Выборка.ВидНоменклатуры);
		КонецЦикла;
		
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", Новый ФиксированныйМассив(МассивДоступныхВидовНоменклатуры)));

	КонецЕсли;
		
	ПараметрыВыбораНоменклатуры = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	Элементы.Номенклатура.ПараметрыВыбора = ПараметрыВыбораНоменклатуры;
	
КонецПроцедуры

#КонецОбласти
